; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=258, out_folder=./training, instance_id=46, seed=2070, goal_proportion=0.03

(define (problem blocksworld-46)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 - object)
 (:init 
    (arm-empty)
    (clear b227)
    (on b227 b19)
    (on b19 b46)
    (on b46 b9)
    (on b9 b138)
    (on b138 b63)
    (on b63 b110)
    (on-table b110)
    (clear b4)
    (on b4 b201)
    (on b201 b224)
    (on-table b224)
    (clear b68)
    (on-table b68)
    (clear b217)
    (on b217 b141)
    (on b141 b218)
    (on b218 b80)
    (on-table b80)
    (clear b212)
    (on b212 b184)
    (on b184 b1)
    (on-table b1)
    (clear b207)
    (on b207 b219)
    (on-table b219)
    (clear b172)
    (on b172 b18)
    (on b18 b88)
    (on-table b88)
    (clear b225)
    (on b225 b187)
    (on-table b187)
    (clear b71)
    (on b71 b156)
    (on b156 b177)
    (on b177 b256)
    (on b256 b143)
    (on b143 b246)
    (on-table b246)
    (clear b254)
    (on b254 b58)
    (on b58 b157)
    (on b157 b175)
    (on b175 b117)
    (on b117 b37)
    (on b37 b146)
    (on b146 b67)
    (on b67 b56)
    (on b56 b240)
    (on b240 b239)
    (on-table b239)
    (clear b30)
    (on b30 b125)
    (on-table b125)
    (clear b135)
    (on b135 b167)
    (on b167 b231)
    (on b231 b197)
    (on b197 b105)
    (on b105 b142)
    (on-table b142)
    (clear b25)
    (on-table b25)
    (clear b51)
    (on b51 b116)
    (on b116 b154)
    (on b154 b118)
    (on b118 b53)
    (on b53 b155)
    (on b155 b38)
    (on b38 b81)
    (on b81 b137)
    (on b137 b166)
    (on b166 b72)
    (on b72 b183)
    (on b183 b151)
    (on-table b151)
    (clear b123)
    (on-table b123)
    (clear b174)
    (on b174 b10)
    (on-table b10)
    (clear b242)
    (on b242 b95)
    (on-table b95)
    (clear b250)
    (on b250 b104)
    (on-table b104)
    (clear b203)
    (on b203 b55)
    (on-table b55)
    (clear b50)
    (on b50 b249)
    (on b249 b60)
    (on-table b60)
    (clear b79)
    (on b79 b23)
    (on-table b23)
    (clear b215)
    (on b215 b83)
    (on b83 b208)
    (on b208 b35)
    (on b35 b114)
    (on b114 b7)
    (on b7 b145)
    (on b145 b209)
    (on b209 b238)
    (on-table b238)
    (clear b247)
    (on b247 b47)
    (on-table b47)
    (clear b28)
    (on b28 b48)
    (on-table b48)
    (clear b220)
    (on b220 b27)
    (on b27 b233)
    (on b233 b78)
    (on b78 b140)
    (on-table b140)
    (clear b152)
    (on b152 b94)
    (on b94 b124)
    (on b124 b93)
    (on b93 b251)
    (on b251 b235)
    (on-table b235)
    (clear b153)
    (on b153 b69)
    (on b69 b12)
    (on b12 b199)
    (on b199 b89)
    (on b89 b15)
    (on b15 b213)
    (on b213 b57)
    (on b57 b150)
    (on b150 b131)
    (on b131 b232)
    (on-table b232)
    (clear b40)
    (on b40 b31)
    (on b31 b170)
    (on b170 b13)
    (on-table b13)
    (clear b119)
    (on b119 b230)
    (on b230 b84)
    (on b84 b163)
    (on b163 b33)
    (on b33 b59)
    (on b59 b189)
    (on b189 b54)
    (on b54 b186)
    (on b186 b42)
    (on b42 b120)
    (on b120 b100)
    (on b100 b133)
    (on b133 b243)
    (on b243 b171)
    (on b171 b194)
    (on b194 b122)
    (on b122 b161)
    (on b161 b165)
    (on b165 b205)
    (on b205 b70)
    (on b70 b204)
    (on b204 b188)
    (on b188 b97)
    (on b97 b102)
    (on b102 b85)
    (on b85 b144)
    (on b144 b2)
    (on b2 b74)
    (on b74 b193)
    (on b193 b158)
    (on b158 b36)
    (on-table b36)
    (clear b101)
    (on b101 b32)
    (on b32 b41)
    (on b41 b106)
    (on-table b106)
    (clear b62)
    (on b62 b185)
    (on b185 b168)
    (on-table b168)
    (clear b87)
    (on b87 b176)
    (on b176 b113)
    (on b113 b128)
    (on-table b128)
    (clear b169)
    (on b169 b192)
    (on b192 b66)
    (on-table b66)
    (clear b14)
    (on-table b14)
    (clear b223)
    (on b223 b5)
    (on-table b5)
    (clear b6)
    (on-table b6)
    (clear b190)
    (on b190 b98)
    (on-table b98)
    (clear b16)
    (on-table b16)
    (clear b90)
    (on b90 b45)
    (on-table b45)
    (clear b214)
    (on b214 b195)
    (on b195 b191)
    (on b191 b182)
    (on b182 b149)
    (on-table b149)
    (clear b179)
    (on b179 b121)
    (on b121 b132)
    (on b132 b222)
    (on b222 b221)
    (on b221 b49)
    (on b49 b245)
    (on b245 b64)
    (on b64 b21)
    (on-table b21)
    (clear b34)
    (on b34 b65)
    (on b65 b139)
    (on b139 b211)
    (on-table b211)
    (clear b178)
    (on b178 b210)
    (on b210 b111)
    (on b111 b107)
    (on b107 b148)
    (on-table b148)
    (clear b226)
    (on b226 b253)
    (on b253 b76)
    (on b76 b229)
    (on b229 b159)
    (on-table b159)
    (clear b160)
    (on-table b160)
    (clear b91)
    (on b91 b136)
    (on b136 b126)
    (on b126 b237)
    (on b237 b3)
    (on b3 b258)
    (on b258 b108)
    (on-table b108)
    (clear b236)
    (on b236 b196)
    (on-table b196)
    (clear b86)
    (on b86 b257)
    (on-table b257)
    (clear b241)
    (on-table b241)
    (clear b112)
    (on b112 b92)
    (on b92 b162)
    (on b162 b206)
    (on b206 b26)
    (on b26 b234)
    (on-table b234)
    (clear b216)
    (on b216 b180)
    (on-table b180)
    (clear b103)
    (on b103 b99)
    (on b99 b181)
    (on b181 b61)
    (on-table b61)
    (clear b127)
    (on-table b127)
    (clear b77)
    (on b77 b244)
    (on-table b244)
    (clear b96)
    (on b96 b147)
    (on b147 b73)
    (on b73 b228)
    (on b228 b8)
    (on-table b8)
    (clear b75)
    (on b75 b115)
    (on b115 b173)
    (on b173 b255)
    (on b255 b252)
    (on b252 b109)
    (on b109 b134)
    (on b134 b20)
    (on b20 b44)
    (on b44 b29)
    (on b29 b11)
    (on b11 b248)
    (on b248 b202)
    (on b202 b43)
    (on b43 b17)
    (on-table b17)
    (clear b129)
    (on b129 b24)
    (on b24 b164)
    (on-table b164)
    (clear b130)
    (on-table b130)
    (clear b82)
    (on b82 b198)
    (on-table b198)
    (clear b22)
    (on b22 b39)
    (on-table b39)
    (clear b52)
    (on b52 b200)
    (on-table b200))
 (:goal  (and 
    (clear b3)
    (on-table b3)
    (clear b1)
    (on-table b1)
    (clear b5)
    (on b5 b4)
    (on b4 b7)
    (on-table b7)
    (clear b6)
    (on b6 b2)
    (on-table b2))))

; plan
1. (unstack b119 b230)
   deleted: (on b119 b230) (clear b119) (arm-empty)
   added: (holding b119) (clear b230)
   goals met: 2 of 11
2. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 2 of 11
3. (unstack b212 b184)
   deleted: (on b212 b184) (clear b212) (arm-empty)
   added: (holding b212) (clear b184)
   goals met: 2 of 11
4. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 2 of 11
5. (unstack b184 b1)
   deleted: (on b184 b1) (clear b184) (arm-empty)
   added: (holding b184) (clear b1)
   goals met: 3 of 11
6. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 3 of 11
7. (unstack b215 b83)
   deleted: (on b215 b83) (clear b215) (arm-empty)
   added: (holding b215) (clear b83)
   goals met: 3 of 11
8. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 3 of 11
9. (unstack b223 b5)
   deleted: (on b223 b5) (clear b223) (arm-empty)
   added: (holding b223) (clear b5)
   goals met: 4 of 11
10. (putdown b223)
   deleted: (holding b223)
   added: (clear b223) (arm-empty) (on-table b223)
   goals met: 4 of 11
11. (unstack b230 b84)
   deleted: (on b230 b84) (clear b230) (arm-empty)
   added: (holding b230) (clear b84)
   goals met: 4 of 11
12. (putdown b230)
   deleted: (holding b230)
   added: (clear b230) (arm-empty) (on-table b230)
   goals met: 4 of 11
13. (unstack b83 b208)
   deleted: (on b83 b208) (clear b83) (arm-empty)
   added: (holding b83) (clear b208)
   goals met: 4 of 11
14. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 4 of 11
15. (unstack b208 b35)
   deleted: (on b208 b35) (clear b208) (arm-empty)
   added: (holding b208) (clear b35)
   goals met: 4 of 11
16. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 4 of 11
17. (unstack b35 b114)
   deleted: (on b35 b114) (clear b35) (arm-empty)
   added: (holding b35) (clear b114)
   goals met: 4 of 11
18. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 11
19. (unstack b114 b7)
   deleted: (on b114 b7) (clear b114) (arm-empty)
   added: (holding b114) (clear b7)
   goals met: 4 of 11
20. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 4 of 11
21. (unstack b7 b145)
   deleted: (on b7 b145) (clear b7) (arm-empty)
   added: (holding b7) (clear b145)
   goals met: 4 of 11
22. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 11
23. (unstack b84 b163)
   deleted: (on b84 b163) (clear b84) (arm-empty)
   added: (holding b84) (clear b163)
   goals met: 5 of 11
24. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 5 of 11
25. (unstack b163 b33)
   deleted: (on b163 b33) (clear b163) (arm-empty)
   added: (holding b163) (clear b33)
   goals met: 5 of 11
26. (putdown b163)
   deleted: (holding b163)
   added: (clear b163) (arm-empty) (on-table b163)
   goals met: 5 of 11
27. (unstack b33 b59)
   deleted: (on b33 b59) (clear b33) (arm-empty)
   added: (holding b33) (clear b59)
   goals met: 5 of 11
28. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 11
29. (unstack b59 b189)
   deleted: (on b59 b189) (clear b59) (arm-empty)
   added: (holding b59) (clear b189)
   goals met: 5 of 11
30. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 5 of 11
31. (unstack b189 b54)
   deleted: (on b189 b54) (clear b189) (arm-empty)
   added: (holding b189) (clear b54)
   goals met: 5 of 11
32. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 5 of 11
33. (unstack b54 b186)
   deleted: (on b54 b186) (clear b54) (arm-empty)
   added: (holding b54) (clear b186)
   goals met: 5 of 11
34. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 5 of 11
35. (unstack b186 b42)
   deleted: (on b186 b42) (clear b186) (arm-empty)
   added: (holding b186) (clear b42)
   goals met: 5 of 11
36. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 5 of 11
37. (unstack b42 b120)
   deleted: (on b42 b120) (clear b42) (arm-empty)
   added: (holding b42) (clear b120)
   goals met: 5 of 11
38. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 5 of 11
39. (unstack b120 b100)
   deleted: (on b120 b100) (clear b120) (arm-empty)
   added: (holding b120) (clear b100)
   goals met: 5 of 11
40. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 5 of 11
41. (unstack b100 b133)
   deleted: (on b100 b133) (clear b100) (arm-empty)
   added: (holding b100) (clear b133)
   goals met: 5 of 11
42. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 5 of 11
43. (unstack b133 b243)
   deleted: (on b133 b243) (clear b133) (arm-empty)
   added: (holding b133) (clear b243)
   goals met: 5 of 11
44. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 5 of 11
45. (unstack b243 b171)
   deleted: (on b243 b171) (clear b243) (arm-empty)
   added: (holding b243) (clear b171)
   goals met: 5 of 11
46. (putdown b243)
   deleted: (holding b243)
   added: (clear b243) (arm-empty) (on-table b243)
   goals met: 5 of 11
47. (unstack b171 b194)
   deleted: (on b171 b194) (clear b171) (arm-empty)
   added: (holding b171) (clear b194)
   goals met: 5 of 11
48. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 5 of 11
49. (unstack b194 b122)
   deleted: (on b194 b122) (clear b194) (arm-empty)
   added: (holding b194) (clear b122)
   goals met: 5 of 11
50. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 5 of 11
51. (unstack b122 b161)
   deleted: (on b122 b161) (clear b122) (arm-empty)
   added: (holding b122) (clear b161)
   goals met: 5 of 11
52. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 5 of 11
53. (unstack b161 b165)
   deleted: (on b161 b165) (clear b161) (arm-empty)
   added: (holding b161) (clear b165)
   goals met: 5 of 11
54. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 5 of 11
55. (unstack b165 b205)
   deleted: (on b165 b205) (clear b165) (arm-empty)
   added: (holding b165) (clear b205)
   goals met: 5 of 11
56. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 5 of 11
57. (unstack b205 b70)
   deleted: (on b205 b70) (clear b205) (arm-empty)
   added: (holding b205) (clear b70)
   goals met: 5 of 11
58. (putdown b205)
   deleted: (holding b205)
   added: (clear b205) (arm-empty) (on-table b205)
   goals met: 5 of 11
59. (unstack b70 b204)
   deleted: (on b70 b204) (clear b70) (arm-empty)
   added: (holding b70) (clear b204)
   goals met: 5 of 11
60. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 5 of 11
61. (unstack b204 b188)
   deleted: (on b204 b188) (clear b204) (arm-empty)
   added: (holding b204) (clear b188)
   goals met: 5 of 11
62. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 5 of 11
63. (unstack b188 b97)
   deleted: (on b188 b97) (clear b188) (arm-empty)
   added: (holding b188) (clear b97)
   goals met: 5 of 11
64. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 5 of 11
65. (unstack b91 b136)
   deleted: (on b91 b136) (clear b91) (arm-empty)
   added: (holding b91) (clear b136)
   goals met: 5 of 11
66. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 5 of 11
67. (unstack b136 b126)
   deleted: (on b136 b126) (clear b136) (arm-empty)
   added: (holding b136) (clear b126)
   goals met: 5 of 11
68. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 5 of 11
69. (unstack b126 b237)
   deleted: (on b126 b237) (clear b126) (arm-empty)
   added: (holding b126) (clear b237)
   goals met: 5 of 11
70. (putdown b126)
   deleted: (holding b126)
   added: (clear b126) (arm-empty) (on-table b126)
   goals met: 5 of 11
71. (unstack b237 b3)
   deleted: (on b237 b3) (clear b237) (arm-empty)
   added: (holding b237) (clear b3)
   goals met: 6 of 11
72. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 6 of 11
73. (unstack b3 b258)
   deleted: (on b3 b258) (clear b3) (arm-empty)
   added: (holding b3) (clear b258)
   goals met: 5 of 11
74. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 11
75. (unstack b97 b102)
   deleted: (on b97 b102) (clear b97) (arm-empty)
   added: (holding b97) (clear b102)
   goals met: 7 of 11
76. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 7 of 11
77. (unstack b102 b85)
   deleted: (on b102 b85) (clear b102) (arm-empty)
   added: (holding b102) (clear b85)
   goals met: 7 of 11
78. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 7 of 11
79. (unstack b85 b144)
   deleted: (on b85 b144) (clear b85) (arm-empty)
   added: (holding b85) (clear b144)
   goals met: 7 of 11
80. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 7 of 11
81. (unstack b144 b2)
   deleted: (on b144 b2) (clear b144) (arm-empty)
   added: (holding b144) (clear b2)
   goals met: 7 of 11
82. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 7 of 11
83. (unstack b2 b74)
   deleted: (on b2 b74) (clear b2) (arm-empty)
   added: (holding b2) (clear b74)
   goals met: 7 of 11
84. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 11
85. (unstack b4 b201)
   deleted: (on b4 b201) (clear b4) (arm-empty)
   added: (holding b4) (clear b201)
   goals met: 8 of 11
86. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 9 of 11
87. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 11
88. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 10 of 11
89. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 11
90. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 11 of 11
